**1**. (25 points)

Use the SQLite3 database `faculty.db` and answer the following query:

- Make a table of the number of people who know each language from each country, making sure to spell out the full name of the country and language, only showing rows with a count of at least 7
- The final solution should look like `country_language.csv`

In [26]:
pd.read_csv('country_language.csv')

    country    language  number
0     China         PHP      10
1  Cambodia        Bash      10
2  Cambodia          C#       8
3  Cambodia      Ceylon       8
4  Cambodia        Java      10
5  Cambodia        Perl      12
6  Cambodia      Racket       8
7  Cambodia        Ruby       8
8  Cambodia  TypeScript       8

In [18]:
%load_ext sql

In [19]:
%sql sqlite:///faculty.db

'Connected: @faculty.db'

In [20]:
%%sql

SELECT * FROM sqlite_master WHERE type=='table'

 * sqlite:///faculty.db
Done.

[('table', 'person', 'person', 2, 'CREATE TABLE person (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tfirst TEXT, \n\tlast TEXT, \n\tage BIGINT, \n\theight FLOAT, \n\tweight BIGINT, \n\tcountry_id TEXT, \n\tgender_id BIGINT\n)'),
 ('table', 'confidential', 'confidential', 18, 'CREATE TABLE confidential (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tsalary BIGINT\n)'),
 ('table', 'person_language', 'person_language', 33, 'CREATE TABLE person_language (\n\t"index" BIGINT, \n\tperson_id BIGINT, \n\tlanguage_id BIGINT\n)'),
 ('table', 'language', 'language', 50, 'CREATE TABLE language (\n\t"index" BIGINT, \n\tlanguage_id BIGINT, \n\tlanguage_name TEXT\n)'),
 ('table', 'gender', 'gender', 55, 'CREATE TABLE gender (\n\t"index" BIGINT, \n\tgender_id BIGINT, \n\tgender TEXT\n)'),
 ('table', 'country', 'country', 57, 'CREATE TABLE country (\n\t"index" BIGINT, \n\tcountry_id TEXT, \n\tcountry TEXT, \n\tnationality TEXT\n)')]

**2**. (25 points)

- Read the file `wnv_human_cases.csv` as a `pandas` DataFrame
- Add up the positive cases for each year
- Find the week in the year when there are the highest average cases of West Nile virus reported
- Which county reported the highest number of cases in that week and what year did it happen?
- Plot the orignal data and a rolling average with window length of 3 and minimum period of 1 on the same plot

In [5]:
%matplotlib inline

In [6]:
import pandas as pd

**3**. 25 points

- Create a `pandas` DataFrame from the data in `yuck.csv`
- When done, your DataFame should look like the one in `less_yuck.csv`

In [14]:
pd.read_csv('less_yuck.csv')

     first            last  age
0   Driehe  Dietriech, von   23
1    Ahmad    Ibrahim, bin   34
2  Charles            Blow   57
3   Andrew        Carnegie   87
4      Amy            Good   12

**4**. (25 points)

We provide a simple tree represented as nested Python dictionaries. Write a recursive function `visit(t)` that will print the value of the `v` key for all nodes in a tree, using indentation to show off the tree structure. For example,

```python
visit(t)
```
should return
```
  1234
    2345
      3456
      4567
    5678
      6789
```

In [1]:
t = {
        'v': 1234,
        'l': {
            'v': 2345,
            'l': {
                'v': 3456,
                'l': None,
                'r': None
            },
            'r':{
                'v': 4567,
                'l': None,
                'r': None
            },
        },
        'r': {
            'v': 5678,
            'l': None,
            'r': {
                'v': 6789,
                'l': None,
                'r': None
            },
        }
    }